tap "1password/tap"
tap "daipeihust/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jerry/neovim-versions"
tap "jesseduffield/lazygit"
brew "act"
brew "giflib"
brew "xz"
brew "awscli"
brew "fontconfig"
brew "cairo"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "docker"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "htop"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "pango"
brew "librsvg"
brew "llvm"
brew "luarocks"
brew "mysql-client"
brew "mysql@8.4"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "openjdk@21"
brew "pandoc"
brew "pkgconf"
brew "pnpm"
brew "pyenv"
brew "python@3.10"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "syncthing"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "daipeihust/tap/im-select"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "1password-cli"
cask "arc"
cask "claude"
cask "codex"
cask "cursor"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "gureumkim"
cask "hammerspoon"
cask "iterm2"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "slack"
cask "visual-studio-code"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "bierner.folder-source-actions"
vscode "bradlc.vscode-tailwindcss"
vscode "brittanychiang.halcyon-vscode"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pawelborkar.jellyfish"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "slhsxcmy.vscode-double-line-numbers"
vscode "stephlin.vscode-tmux-keybinding"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "sveggiani.vscode-field-lights"
vscode "svelte.svelte-vscode"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
cargo "code-minimap"
